In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.shape

(891, 15)

In [5]:
df = titanic.loc[:, ['age', 'fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [6]:
df.apply(len)

age     891
fare    891
dtype: int64

In [7]:
def missing_value(series):
    y = series.isnull()

df.apply(missing_value)

age     None
fare    None
dtype: object

In [8]:
df.apply(lambda x : x.isnull())

       age   fare
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]

In [9]:
df.apply(lambda x: x['age'] + x['fare'], axis = 1)

0       29.2500
1      109.2833
2       33.9250
3       88.1000
4       43.0500
         ...
886     40.0000
887     49.0000
888         NaN
889     56.0000
890     39.7500
Length: 891, dtype: float64

In [10]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [11]:
df.sort_values(by = 'fare', ascending=True)

      age      fare
271  25.0    0.0000
597  49.0    0.0000
302  19.0    0.0000
633   NaN    0.0000
277   NaN    0.0000
..    ...       ...
438  64.0  263.0000
341  24.0  263.0000
737  35.0  512.3292
258  35.0  512.3292
679  36.0  512.3292

[891 rows x 2 columns]

In [12]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [18]:
rev_columns = list(reversed(titanic.columns))
list(rev_columns)

['alone',
 'alive',
 'embark_town',
 'deck',
 'adult_male',
 'who',
 'class',
 'embarked',
 'fare',
 'parch',
 'sibsp',
 'age',
 'sex',
 'pclass',
 'survived']

In [19]:
rev_titanic = titanic[rev_columns]
rev_titanic.head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

In [21]:
df = pd.read_excel('./주가데이터.xlsx', header=0, index_col=0)
dates = df.index.astype('str')
dates

Index(['2018-07-02', '2018-06-29', '2018-06-28', '2018-06-27', '2018-06-26',
       '2018-06-25', '2018-06-22', '2018-06-21', '2018-06-20', '2018-06-19',
       '2018-06-18', '2018-06-15', '2018-06-14', '2018-06-12', '2018-06-11',
       '2018-06-08', '2018-06-07', '2018-06-05', '2018-06-04', '2018-06-01'],
      dtype='object', name='연월일')

In [22]:
dates.str.split('-')

Index([['2018', '07', '02'], ['2018', '06', '29'], ['2018', '06', '28'],
       ['2018', '06', '27'], ['2018', '06', '26'], ['2018', '06', '25'],
       ['2018', '06', '22'], ['2018', '06', '21'], ['2018', '06', '20'],
       ['2018', '06', '19'], ['2018', '06', '18'], ['2018', '06', '15'],
       ['2018', '06', '14'], ['2018', '06', '12'], ['2018', '06', '11'],
       ['2018', '06', '08'], ['2018', '06', '07'], ['2018', '06', '05'],
       ['2018', '06', '04'], ['2018', '06', '01']],
      dtype='object', name='연월일')